app/controllers/friends_controller.rb

  def update
    respond_to do |format|
      if @friend.update(friend_params)
---
UPDATE "friends" SET "first_name" = ?, "updated_at" = ? WHERE "friends"."id" = ?  [["first_name", "John1"], ["updated_at", "2021-05-17 16:21:28.570544"], ["id", 4]]